rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_LPI2C.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.4
**     Version:             rev. 1.5, 2024-08-01
**     Build:               b240801
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_LPI2C.h
 * @version 1.5
 * @date 2024-08-01
 * @brief Peripheral Access Layer for S32M24x_LPI2C
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_LPI2C_H_) /* Check if memory map has not been already included */
#define S32M24x_LPI2C_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LPI2C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Peripheral_Access_Layer LPI2C Peripheral Access Layer
 * @{
 */

/** LPI2C - Register Layout Typedef */
typedef struct {
    __I uint32_t VERID; /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM; /**< Parameter Register, offset: 0x4 */
    uint8_t RESERVED_0[8];
    __IO uint32_t MCR;    /**< Master Control Register, offset: 0x10 */
    __IO uint32_t MSR;    /**< Master Status Register, offset: 0x14 */
    __IO uint32_t MIER;   /**< Master Interrupt Enable Register, offset: 0x18 */
    __IO uint32_t MDER;   /**< Master DMA Enable Register, offset: 0x1C */
    __IO uint32_t MCFGR0; /**< Master Configuration Register 0, offset: 0x20 */
    __IO uint32_t MCFGR1; /**< Master Configuration Register 1, offset: 0x24 */
    __IO uint32_t MCFGR2; /**< Master Configuration Register 2, offset: 0x28 */
    __IO uint32_t MCFGR3; /**< Master Configuration Register 3, offset: 0x2C */
    uint8_t RESERVED_1[16];
    __IO uint32_t MDMR; /**< Master Data Match Register, offset: 0x40 */
    uint8_t RESERVED_2[4];
    __IO uint32_t MCCR0; /**< Master Clock Configuration Register 0, offset: 0x48 */
    uint8_t RESERVED_3[4];
    __IO uint32_t MCCR1; /**< Master Clock Configuration Register 1, offset: 0x50 */
    uint8_t RESERVED_4[4];
    __IO uint32_t MFCR; /**< Master FIFO Control Register, offset: 0x58 */
    __I uint32_t MFSR;  /**< Master FIFO Status Register, offset: 0x5C */
    __O uint32_t MTDR;  /**< Master Transmit Data Register, offset: 0x60 */
    uint8_t RESERVED_5[12];
    __I uint32_t MRDR; /**< Master Receive Data Register, offset: 0x70 */
    uint8_t RESERVED_6[156];
    __IO uint32_t SCR;  /**< Slave Control Register, offset: 0x110 */
    __IO uint32_t SSR;  /**< Slave Status Register, offset: 0x114 */
    __IO uint32_t SIER; /**< Slave Interrupt Enable Register, offset: 0x118 */
    __IO uint32_t SDER; /**< Slave DMA Enable Register, offset: 0x11C */
    uint8_t RESERVED_7[4];
    __IO uint32_t SCFGR1; /**< Slave Configuration Register 1, offset: 0x124 */
    __IO uint32_t SCFGR2; /**< Slave Configuration Register 2, offset: 0x128 */
    uint8_t RESERVED_8[20];
    __IO uint32_t SAMR; /**< Slave Address Match Register, offset: 0x140 */
    uint8_t RESERVED_9[12];
    __I uint32_t SASR;  /**< Slave Address Status Register, offset: 0x150 */
    __IO uint32_t STAR; /**< Slave Transmit ACK Register, offset: 0x154 */
    uint8_t RESERVED_10[8];
    __O uint32_t STDR; /**< Slave Transmit Data Register, offset: 0x160 */
    uint8_t RESERVED_11[12];
    __I uint32_t SRDR; /**< Slave Receive Data Register, offset: 0x170 */
} LPI2C_Type, *LPI2C_MemMapPtr;

/** Number of instances of the LPI2C module. */
#define LPI2C_INSTANCE_COUNT (1u)

/* LPI2C - Peripheral instance base addresses */
/** Peripheral LPI2C0 base address */
#define IP_LPI2C0_BASE (0x40066000u)
/** Peripheral LPI2C0 base pointer */
#define IP_LPI2C0 ((LPI2C_Type*)IP_LPI2C0_BASE)
/** Array initializer of LPI2C peripheral base addresses */
#define IP_LPI2C_BASE_ADDRS                                                                        \
    {                                                                                              \
        IP_LPI2C0_BASE                                                                             \
    }
/** Array initializer of LPI2C peripheral base pointers */
#define IP_LPI2C_BASE_PTRS                                                                         \
    {                                                                                              \
        IP_LPI2C0                                                                                  \
    }

/* ----------------------------------------------------------------------------
   -- LPI2C Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Register_Masks LPI2C Register Masks
 * @{
 */

